function [pt,w] = genRefGauss3DCube(order)
%生成参考单元[-1,1]^3上的Gauss点
%   order为每个维度Gauss点个数
%   pt为Gauss点坐标，每行代表一个点
%   w为Gauss权重
if order==4
    x = [0.861136311594053;-0.861136311594053;0.339981043584856;-0.339981043584856];
    h = [0.347854845137454;0.347854845137454;0.652145154862546;0.652145154862546];
    [X,Y,Z]=meshgrid(x,x,x);
    pt = [X(:),Y(:),Z(:)];
    [h1,h2,h3] = meshgrid(h,h,h);
    w = reshape(h1.*h2.*h3,[],1);
elseif order==8
    h=[0.1012285363,0.1012285363,0.2223810345,0.2223810345,0.3137066459,0.3137066459,0.3626837834,0.3626837834];
    x=[0.9602898565,-0.9602898565,0.7966664774,-0.7966664774,0.5255324099,-0.5255324099,0.1834346425,-0.1834346425];
    [X,Y,Z]=meshgrid(x,x,x);
    pt = [X(:),Y(:),Z(:)];
    [h1,h2,h3] = meshgrid(h,h,h);
    w = reshape(h1.*h2.*h3,[],1);
elseif order==2
    h = [1,1];
    x = [1/sqrt(3),-1/sqrt(3)];
    [X,Y,Z]=meshgrid(x,x,x);
    pt = [X(:),Y(:),Z(:)];
    [h1,h2,h3] = meshgrid(h,h,h);
    w = reshape(h1.*h2.*h3,[],1);
end
end

